trade_exp/src/InformationRegisters/Неликвиды/Неликвиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6135d411-f6c1-4357-98b2-8efecc3556b2">
  <name>Неликвиды</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="1d5252ff-fc63-4e13-9707-bb7deec18032">
    <name>Ликвидность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8808cf9a-cb1b-4ca8-a2ac-e01687e6c2f9">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a0e4f1bf-e5ec-49fc-a362-54516c94aadb">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="abb41226-3835-47ce-8649-d3ec24658d9d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2789d090-8df4-4ecb-9284-5e015e1aacd3">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Неликвиды/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Если Параметры.Свойство("Отбор") Тогда
			Попытка
				УсловияОтбора = Параметры.Отбор.Номенклатура;
			Исключение
				УсловияОтбора = Список.Отбор.Элементы[0].ПравоеЗначение;
			КонецПопытки;
			ВывестиТекущуюКлассификацию();
		КонецЕсли;
		
	Иначе 
		ЭтаФорма.Элементы.ТекущаяКлассификация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ВывестиТекущуюКлассификацию()
	
	ТабДок.Очистить();
	Макет = РегистрыСведений.Неликвиды.ПолучитьМакет("ТекущаяЛиквидность");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НеликвидыСрезПоследних.Подразделение КАК Подразделение,
	|	НеликвидыСрезПоследних.Подразделение.Код КАК ПодразделениеКод,
	|	НеликвидыСрезПоследних.Ликвидность КАК Ликвидность,
	|	НеликвидыСрезПоследних.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.Неликвиды.СрезПоследних(, Номенклатура = &Номенклатура) КАК НеликвидыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеКод";
	
	Запрос.УстановитьПараметр("Номенклатура", УсловияОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ТекущаяКлассификация Тогда
		ВывестиТекущуюКлассификацию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Неликвиды.ФормаЗаписи", Новый Структура("Номенклатура", Неопределено), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
КонецПроцедуры

&НаКлиенте
Процедура ПослеСоздания(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КОнецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Неликвиды.ФормаЗаписи", Новый Структура("ЗначениеЗаполнения", Элементы.Список.ТекущиеДанные), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры
